[{
        "imageUrl": "https://images.unsplash.com/photo-1549989476-69a92fa57c36?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=800&q=60",
        "name": "name1",
        "from": 1,
        "content": "In&nbsp;my previous post, I explained about my painful multi-cloud experience and lessons that I learned. Regardless of which cloud platform you are using, I recommend you to read it to avoid our mistakes. I’ve encountered a surprising high number of Cloud developers who have never tried other providers. That’s why in this post, I would [&hellip;]\n"
    },
    {
        "imageUrl": "https://images.unsplash.com/photo-1549989476-69a92fa57c36?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=800&q=60",
        "name": "name2",
        "from": 0,
        "content": "Feeping in mind the growing multi-cloud trend, developers should start working with more than one provider. However, this can mean leaving your comfort zone, and not everyone likes the idea of doing that. Recently, I’ve done this and would like to share my experiences with you. I believe they are useful, regardless of whatever cloud platform [&hellip;]\n"
    },
    {
        "imageUrl": "https://images.unsplash.com/photo-1549989476-69a92fa57c36?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=800&q=60",
        "name": "name3",
        "from": 1,
        "content": "Hello, this is part one of the series &#8211; Implementing infinite mode in a Carousel that rocks by putting your algorithm knowledge into use. A while back i built a fully customizable Carousel library called react-multi-carousel which you can find on github or the npm registry that supports multiple items and server-side rendering. Everything was [&hellip;]\n"
    },
    {
        "imageUrl": "https://images.unsplash.com/photo-1549989476-69a92fa57c36?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=800&q=60",
        "name": "name4",
        "from": 0,
        "content": "Amazon Lex enables you to quickly build a chatbot in a few minutes. A few months ago, I tried to integrate a Lex chatbot with Facebook — and spent way too long because of the poor documentation and guidance. To help save you some time and effort, this blog explains how the integration works and provides a [&hellip;]\n"
    },
    {
        "imageUrl": "https://images.unsplash.com/photo-1549989476-69a92fa57c36?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=800&q=60",
        "name": "name5",
        "from": 1,
        "content": "Observability is about the ability to troubleshoot unknown issues that might happen in your application. If you are not familiar with it, I recommend you to watch&nbsp;How to Build Observable Distributed Systems&nbsp;and&nbsp;The Present and Future of Serverless Observability&nbsp;from QCon 2018. In this article, I’m going to explain you how some of the most prominent Serverless [&hellip;]\n"
    },
    {
        "imageUrl": "https://images.unsplash.com/photo-1549989476-69a92fa57c36?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=800&q=60",
        "name": "name6",
        "from": 0,
        "content": "Tracing is one of the pillars of Observebility, according to Twitter. AWS X-Ray helps you to get an overview of your distributed application, to find bottlenecks and to tune its critical path. Also, it&nbsp;provides&nbsp;you&nbsp;with the ability to&nbsp;trace your&nbsp;requests, so you can see which journey, any single request goes through when it enters your application. AWS [&hellip;]\n"
    },
    {
        "imageUrl": "https://images.unsplash.com/photo-1549989476-69a92fa57c36?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=800&q=60",
        "name": "name7",
        "from": 1,
        "content": "Recently, I attended AWS Community Days in Frankfurt — Serverless Computing track, while I was one of its speakers. Having 400 attendees, it’s the biggest AWS community event in Germany. Even though not a definite indicator, but it can reflect skill level of serverless community in the region. I would like to share my assessment about Germany’s serverless community’s level with you. Some of them are good (indicated as “promising”) and some of them require attention (indicated as “worrying”). Here is table of content:<\n"
    },
    {
        "imageUrl": "https://images.unsplash.com/photo-1549989476-69a92fa57c36?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=800&q=60",
        "name": "name8",
        "from": 0,
        "content": "Here is the code snippet on how to append currency sign to a purchase form in your e-commerce site. For example, you have an input that allows user to put in the amount of money to filter out some certain products at different price range, you might also want to remind the user of the [&hellip;]\n"
    },
    {
        "imageUrl": "https://images.unsplash.com/photo-1549989476-69a92fa57c36?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=800&q=60",
        "name": "name9",
        "from": 1,
        "content": "Introduction For Nextjs developers, if you are using a third-party UI library for example Material-ui or Semantic-ui, you might end up overriding a lot of the existing styles with your own CSS. That brings to us the importance of the order of which CSS file gets loaded first and after. If your own CSS gets [&hellip;]\n"
    }
]